tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18323_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F18323_H_
#define _PIC16F18323_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define PORTC                         35
#define RC0                           36
#define RC1                           37
#define RC2                           38
#define RC3                           39
#define RC4                           40
#define RC5                           41
#define PIR0                          42
#define INTF                          43
#define IOCIF                         44
#define TMR0IF                        45
#define PIR1                          46
#define TMR1IF                        47
#define TMR2IF                        48
#define BCL1IF                        49
#define SSP1IF                        50
#define TXIF                          51
#define RCIF                          52
#define ADIF                          53
#define TMR1GIF                       54
#define PIR2                          55
#define NCO1IF                        56
#define NVMIF                         57
#define C1IF                          58
#define C2IF                          59
#define PIR3                          60
#define CLC1IF                        61
#define CLC2IF                        62
#define CSWIF                         63
#define OSFIF                         64
#define PIR4                          65
#define CCP1IF                        66
#define CCP2IF                        67
#define CWG1IF                        68
#define TMR00                         69
#define TMR0L                         70
#define TMR01                         71
#define TMR02                         72
#define TMR03                         73
#define TMR04                         74
#define TMR05                         75
#define TMR06                         76
#define TMR07                         77
#define TMR08                         78
#define TMR0H                         79
#define TMR09                         80
#define TMR010                        81
#define TMR011                        82
#define TMR012                        83
#define TMR013                        84
#define TMR014                        85
#define TMR015                        86
#define T0CON0                        87
#define T0OUTPS                       88
#define T0OUTPS0                      89
#define T0OUTPS1                      90
#define T0OUTPS2                      91
#define T0OUTPS3                      92
#define T016BIT                       93
#define T0OUT                         94
#define T0EN                          95
#define T0CON1                        96
#define T0CKPS                        97
#define T0CKPS0                       98
#define T0CKPS1                       99
#define T0CKPS2                       100
#define T0CKPS3                       101
#define T0ASYNC                       102
#define T0CS                          103
#define T0CS0                         104
#define T0CS1                         105
#define T0CS2                         106
#define TMR1L                         107
#define TMR1H                         108
#define T1CON                         109
#define TMR1ON                        110
#define T1SYNC                        111
#define T1SOSC                        112
#define T1CKPS0                       113
#define T1CKPS                        114
#define T1CKPS1                       115
#define TMR1CS0                       116
#define TMR1CS                        117
#define TMR1CS1                       118
#define T1GCON                        119
#define T1GSS0                        120
#define T1GSS                         121
#define T1GSS1                        122
#define T1GVAL                        123
#define T1GGO_nDONE                   124
#define T1GSPM                        125
#define T1GTM                         126
#define T1GPOL                        127
#define TMR1GE                        128
#define TMR2                          129
#define PR2                           130
#define T2CON                         131
#define T2CKPS0                       132
#define T2CKPS                        133
#define T2CKPS1                       134
#define TMR2ON                        135
#define T2OUTPS0                      136
#define T2OUTPS                       137
#define T2OUTPS1                      138
#define T2OUTPS2                      139
#define T2OUTPS3                      140
#define TRISA                         141
#define TRISA0                        142
#define TRISA1                        143
#define TRISA2                        144
#define TRISA4                        145
#define TRISA5                        146
#define TRISC                         147
#define TRISC0                        148
#define TRISC1                        149
#define TRISC2                        150
#define TRISC3                        151
#define TRISC4                        152
#define TRISC5                        153
#define PIE0                          154
#define INTE                          155
#define IOCIE                         156
#define TMR0IE                        157
#define PIE1                          158
#define TMR1IE                        159
#define TMR2IE                        160
#define BCL1IE                        161
#define SSP1IE                        162
#define TXIE                          163
#define RCIE                          164
#define ADIE                          165
#define TMR1GIE                       166
#define PIE2                          167
#define NCO1IE                        168
#define NVMIE                         169
#define C1IE                          170
#define C2IE                          171
#define PIE3                          172
#define CLC1IE                        173
#define CLC2IE                        174
#define CSWIE                         175
#define OSFIE                         176
#define PIE4                          177
#define CCP1IE                        178
#define CCP2IE                        179
#define CWG1IE                        180
#define WDTCON                        181
#define SWDTEN                        182
#define WDTPS                         183
#define WDTPS0                        184
#define WDTPS1                        185
#define WDTPS2                        186
#define WDTPS3                        187
#define WDTPS4                        188
#define ADRESL                        189
#define ADRESH                        190
#define ADCON0                        191
#define ADON                          192
#define GO_nDONE                      193
#define GO                            194
#define ADGO                          195
#define CHS0                          196
#define CHS                           197
#define CHS1                          198
#define CHS2                          199
#define CHS3                          200
#define CHS4                          201
#define CHS5                          202
#define ADCON1                        203
#define ADPREF0                       204
#define ADPREF                        205
#define ADPREF1                       206
#define ADNREF                        207
#define ADCS0                         208
#define ADCS                          209
#define ADCS1                         210
#define ADCS2                         211
#define ADFM                          212
#define ADACT                         213
#define ADACT0                        214
#define ADACT1                        215
#define ADACT2                        216
#define ADACT3                        217
#define LATA                          218
#define LATA0                         219
#define LATA1                         220
#define LATA2                         221
#define LATA4                         222
#define LATA5                         223
#define LATC                          224
#define LATC0                         225
#define LATC1                         226
#define LATC2                         227
#define LATC3                         228
#define LATC4                         229
#define LATC5                         230
#define CM1CON0                       231
#define C1SYNC                        232
#define C1HYS                         233
#define C1SP                          234
#define C1POL                         235
#define C1OUT                         236
#define C1ON                          237
#define CM1CON1                       238
#define C1NCH0                        239
#define C1NCH                         240
#define C1NCH1                        241
#define C1NCH2                        242
#define C1PCH                         243
#define C1PCH0                        244
#define C1PCH1                        245
#define C1PCH2                        246
#define C1INTN                        247
#define C1INTP                        248
#define CM2CON0                       249
#define C2SYNC                        250
#define C2HYS                         251
#define C2SP                          252
#define C2POL                         253
#define C2OUT                         254
#define C2ON                          255
#define CM2CON1                       256
#define C2NCH0                        257
#define C2NCH                         258
#define C2NCH1                        259
#define C2NCH2                        260
#define C2PCH                         261
#define C2PCH0                        262
#define C2PCH1                        263
#define C2PCH2                        264
#define C2INTN                        265
#define C2INTP                        266
#define CMOUT                         267
#define MC1OUT                        268
#define MC2OUT                        269
#define BORCON                        270
#define BORRDY                        271
#define SBOREN                        272
#define FVRCON                        273
#define ADFVR0                        274
#define ADFVR                         275
#define ADFVR1                        276
#define CDAFVR                        277
#define CDAFVR0                       278
#define CDAFVR1                       279
#define TSRNG                         280
#define TSEN                          281
#define FVRRDY                        282
#define FVREN                         283
#define DACCON0                       284
#define DAC1NSS                       285
#define DAC1PSS                       286
#define DAC1PSS0                      287
#define DAC1PSS1                      288
#define DAC1OE                        289
#define DAC1EN                        290
#define DACCON1                       291
#define DAC1R                         292
#define DAC1R0                        293
#define DAC1R1                        294
#define DAC1R2                        295
#define DAC1R3                        296
#define DAC1R4                        297
#define ANSELA                        298
#define ANSA0                         299
#define ANSA1                         300
#define ANSA2                         301
#define ANSA4                         302
#define ANSA5                         303
#define ANSELC                        304
#define ANSC0                         305
#define ANSC1                         306
#define ANSC2                         307
#define ANSC3                         308
#define ANSC4                         309
#define ANSC5                         310
#define VREGCON                       311
#define VREGPM                        312
#define RC1REG                        313
#define TX1REG                        314
#define SP1BRGL                       315
#define SP1BRGH                       316
#define RC1STA                        317
#define RX9D                          318
#define OERR                          319
#define FERR                          320
#define ADDEN                         321
#define CREN                          322
#define SREN                          323
#define RX9                           324
#define SPEN                          325
#define TX1STA                        326
#define TX9D                          327
#define TRMT                          328
#define BRGH                          329
#define SENDB                         330
#define SYNC                          331
#define TXEN                          332
#define TX9                           333
#define CSRC                          334
#define BAUD1CON                      335
#define ABDEN                         336
#define WUE                           337
#define BRG16                         338
#define SCKP                          339
#define RCIDL                         340
#define ABDOVF                        341
#define WPUA                          342
#define WPUA0                         343
#define WPUA1                         344
#define WPUA2                         345
#define WPUA3                         346
#define WPUA4                         347
#define WPUA5                         348
#define WPUC                          349
#define WPUC0                         350
#define WPUC1                         351
#define WPUC2                         352
#define WPUC3                         353
#define WPUC4                         354
#define WPUC5                         355
#define SSP1BUF                       356
#define BUF                           357
#define BUF0                          358
#define SSP1BUF0                      359
#define BUF1                          360
#define SSP1BUF1                      361
#define BUF2                          362
#define SSP1BUF2                      363
#define BUF3                          364
#define SSP1BUF3                      365
#define BUF4                          366
#define SSP1BUF4                      367
#define BUF5                          368
#define SSP1BUF5                      369
#define BUF6                          370
#define SSP1BUF6                      371
#define BUF7                          372
#define SSP1BUF7                      373
#define ADD0                          374
#define ADD                           375
#define SSP1ADD0                      376
#define SSP1ADD                       377
#define ADD1                          378
#define SSP1ADD1                      379
#define ADD2                          380
#define SSP1ADD2                      381
#define ADD3                          382
#define SSP1ADD3                      383
#define ADD4                          384
#define SSP1ADD4                      385
#define ADD5                          386
#define SSP1ADD5                      387
#define ADD6                          388
#define SSP1ADD6                      389
#define ADD7                          390
#define SSP1ADD7                      391
#define SSP1MSK0                      392
#define SSP1MSK                       393
#define MSK0                          394
#define MSK                           395
#define SSP1MSK1                      396
#define MSK1                          397
#define SSP1MSK2                      398
#define MSK2                          399
#define SSP1MSK3                      400
#define MSK3                          401
#define SSP1MSK4                      402
#define MSK4                          403
#define SSP1MSK5                      404
#define MSK5                          405
#define SSP1MSK6                      406
#define MSK6                          407
#define SSP1MSK7                      408
#define MSK7                          409
#define SSP1STAT                      410
#define BF                            411
#define UA                            412
#define R_nW                          413
#define S                             414
#define P                             415
#define D_nA                          416
#define CKE                           417
#define SMP                           418
#define SSP1CON1                      419
#define SSPM0                         420
#define SSPM                          421
#define SSPM1                         422
#define SSPM2                         423
#define SSPM3                         424
#define CKP                           425
#define SSPEN                         426
#define SSPOV                         427
#define WCOL                          428
#define SSP1CON2                      429
#define SEN                           430
#define RSEN                          431
#define PEN                           432
#define RCEN                          433
#define ACKEN                         434
#define ACKDT                         435
#define ACKSTAT                       436
#define GCEN                          437
#define SSP1CON3                      438
#define DHEN                          439
#define AHEN                          440
#define SBCDE                         441
#define SDAHT                         442
#define BOEN                          443
#define SCIE                          444
#define PCIE                          445
#define ACKTIM                        446
#define ODCONA                        447
#define ODCA0                         448
#define ODCA1                         449
#define ODCA2                         450
#define ODCA4                         451
#define ODCA5                         452
#define ODCONC                        453
#define ODCC0                         454
#define ODCC1                         455
#define ODCC2                         456
#define ODCC3                         457
#define ODCC4                         458
#define ODCC5                         459
#define CCPR1L                        460
#define CCPR1H                        461
#define CCP1CON                       462
#define CCP1MODE                      463
#define CCP1MODE0                     464
#define CCP1MODE1                     465
#define CCP1MODE2                     466
#define CCP1MODE3                     467
#define CCP1FMT                       468
#define CCP1OUT                       469
#define CCP1EN                        470
#define CCP1CAP                       471
#define CCP1CTS                       472
#define CCP1CTS0                      473
#define CCP1CTS1                      474
#define CCP1CTS2                      475
#define CCPR2L                        476
#define CCPR2H                        477
#define CCP2CON                       478
#define CCP2MODE                      479
#define CCP2MODE0                     480
#define CCP2MODE1                     481
#define CCP2MODE2                     482
#define CCP2MODE3                     483
#define CCP2FMT                       484
#define CCP2OUT                       485
#define CCP2EN                        486
#define CCP2CAP                       487
#define CCP2CTS                       488
#define CCP2CTS0                      489
#define CCP2CTS1                      490
#define CCP2CTS2                      491
#define CCPTMRS                       492
#define C1TSEL                        493
#define C2TSEL                        494
#define SLRCONA                       495
#define SLRA0                         496
#define SLRA1                         497
#define SLRA2                         498
#define SLRA4                         499
#define SLRA5                         500
#define SLRCONC                       501
#define SLRC0                         502
#define SLRC1                         503
#define SLRC2                         504
#define SLRC3                         505
#define SLRC4                         506
#define SLRC5                         507
#define INLVLA                        508
#define INLVLA0                       509
#define INLVLA1                       510
#define INLVLA2                       511
#define INLVLA3                       512
#define INLVLA4                       513
#define INLVLA5                       514
#define INLVLC                        515
#define INLVLC0                       516
#define INLVLC1                       517
#define INLVLC2                       518
#define INLVLC3                       519
#define INLVLC4                       520
#define INLVLC5                       521
