tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18323_tdd.h
#define IOCAP                         522
#define IOCAP0                        523
#define IOCAP1                        524
#define IOCAP2                        525
#define IOCAP3                        526
#define IOCAP4                        527
#define IOCAP5                        528
#define IOCAN                         529
#define IOCAN0                        530
#define IOCAN1                        531
#define IOCAN2                        532
#define IOCAN3                        533
#define IOCAN4                        534
#define IOCAN5                        535
#define IOCAF                         536
#define IOCAF0                        537
#define IOCAF1                        538
#define IOCAF2                        539
#define IOCAF3                        540
#define IOCAF4                        541
#define IOCAF5                        542
#define IOCCP                         543
#define IOCCP0                        544
#define IOCCP1                        545
#define IOCCP2                        546
#define IOCCP3                        547
#define IOCCP4                        548
#define IOCCP5                        549
#define IOCCN                         550
#define IOCCN0                        551
#define IOCCN1                        552
#define IOCCN2                        553
#define IOCCN3                        554
#define IOCCN4                        555
#define IOCCN5                        556
#define IOCCF                         557
#define IOCCF0                        558
#define IOCCF1                        559
#define IOCCF2                        560
#define IOCCF3                        561
#define IOCCF4                        562
#define IOCCF5                        563
#define CLKRCON                       564
#define CLKRDIV                       565
#define CLKRDIV0                      566
#define CLKRDIV1                      567
#define CLKRDIV2                      568
#define CLKRDC                        569
#define CLKRDC0                       570
#define CLKRDC1                       571
#define CLKREN                        572
#define MDCON                         573
#define MDBIT                         574
#define MDOUT                         575
#define MDOPOL                        576
#define MDEN                          577
#define MDSRC                         578
#define MDMS0                         579
#define MDMS                          580
#define MDMS1                         581
#define MDMS2                         582
#define MDMS3                         583
#define MDCARH                        584
#define MDCH                          585
#define MDCH0                         586
#define MDCH1                         587
#define MDCH2                         588
#define MDCH3                         589
#define MDCHSYNC                      590
#define MDCHPOL                       591
#define MDCARL                        592
#define MDCL0                         593
#define MDCL                          594
#define MDCL1                         595
#define MDCL2                         596
#define MDCL3                         597
#define MDCLSYNC                      598
#define MDCLPOL                       599
#define CCDNA                         600
#define CCDNA0                        601
#define CCDNA1                        602
#define CCDNA2                        603
#define CCDNA4                        604
#define CCDNA5                        605
#define CCDNC                         606
#define CCDNC0                        607
#define CCDNC1                        608
#define CCDNC2                        609
#define CCDNC3                        610
#define CCDNC4                        611
#define CCDNC5                        612
#define CCDCON                        613
#define CCDS                          614
#define CCDS0                         615
#define CCDS1                         616
#define CCDEN                         617
#define CCDPA                         618
#define CCDPA0                        619
#define CCDPA1                        620
#define CCDPA2                        621
#define CCDPA4                        622
#define CCDPA5                        623
#define CCDPC                         624
#define CCDPC0                        625
#define CCDPC1                        626
#define CCDPC2                        627
#define CCDPC3                        628
#define CCDPC4                        629
#define CCDPC5                        630
#define NCO1ACCL                      631
#define NCO1ACCL_NCO1ACC              632
#define NCO1ACCH                      633
#define NCO1ACCH_NCO1ACC              634
#define NCO1ACCU                      635
#define NCO1ACCU_NCO1ACC              636
#define NCO1INCL                      637
#define NCO1INCL_NCO1INC              638
#define NCO1INCH                      639
#define NCO1INCH_NCO1INC              640
#define NCO1INCU                      641
#define NCO1INCU_NCO1INC              642
#define NCO1CON                       643
#define N1PFM                         644
#define N1POL                         645
#define N1OUT                         646
#define N1EN                          647
#define NCO1CLK                       648
#define N1CKS                         649
#define N1PWS                         650
#define PWM5DCL                       651
#define PWM5DCL0                      652
#define PWM5DCL1                      653
#define PWM5DCH                       654
#define PWM5DCH0                      655
#define PWM5DCH1                      656
#define PWM5DCH2                      657
#define PWM5DCH3                      658
#define PWM5DCH4                      659
#define PWM5DCH5                      660
#define PWM5DCH6                      661
#define PWM5DCH7                      662
#define PWM5CON                       663
#define PWM5POL                       664
#define PWM5OUT                       665
#define PWM5EN                        666
#define PWM6DCL                       667
#define PWM6DCL0                      668
#define PWM6DCL1                      669
#define PWM6DCH                       670
#define PWM6DCH0                      671
#define PWM6DCH1                      672
#define PWM6DCH2                      673
#define PWM6DCH3                      674
#define PWM6DCH4                      675
#define PWM6DCH5                      676
#define PWM6DCH6                      677
#define PWM6DCH7                      678
#define PWM6CON                       679
#define PWM6POL                       680
#define PWM6OUT                       681
#define PWM6EN                        682
#define CWG1CLKCON                    683
#define CS                            684
#define CWG1CS                        685
#define CWG1DAT                       686
#define DAT                           687
#define CWG1DAT0                      688
#define CWG1DAT1                      689
#define CWG1DAT2                      690
#define CWG1DAT3                      691
#define CWG1DBR0                      692
#define CWG1DBR                       693
#define DBR                           694
#define DBR0                          695
#define CWG1DBR1                      696
#define DBR1                          697
#define CWG1DBR2                      698
#define DBR2                          699
#define CWG1DBR3                      700
#define DBR3                          701
#define CWG1DBR4                      702
#define DBR4                          703
#define CWG1DBR5                      704
#define DBR5                          705
#define CWG1DBF                       706
#define CWG1DBF0                      707
#define DBF                           708
#define DBF0                          709
#define CWG1DBF1                      710
#define DBF1                          711
#define CWG1DBF2                      712
#define DBF2                          713
#define CWG1DBF3                      714
#define DBF3                          715
#define CWG1DBF4                      716
#define DBF4                          717
#define DBF5                          718
#define CWG1DBF5                      719
#define CWG1CON0                      720
#define CWG1MODE0                     721
#define CWG1CON0_MODE                 722
#define CWG1CON0_MODE0                723
#define CWG1MODE                      724
#define CWG1MODE1                     725
#define CWG1CON0_MODE1                726
#define CWG1MODE2                     727
#define CWG1CON0_MODE2                728
#define LD                            729
#define CWG1LD                        730
#define CWG1EN                        731
#define G1EN                          732
#define CWG1CON0_EN                   733
#define CWG1CON1                      734
#define CWG1POLA                      735
#define POLA                          736
#define CWG1POLB                      737
#define POLB                          738
#define CWG1POLC                      739
#define POLC                          740
#define CWG1POLD                      741
#define POLD                          742
#define IN                            743
#define CWG1IN                        744
#define CWG1AS0                       745
#define CWG1LSAC                      746
#define LSAC                          747
#define LSAC0                         748
#define CWG1LSAC0                     749
#define LSAC1                         750
#define CWG1LSAC1                     751
#define LSBD0                         752
#define CWG1LSBD0                     753
#define LSBD                          754
#define CWG1LSBD                      755
#define LSBD1                         756
#define CWG1LSBD1                     757
#define CWG1REN                       758
#define REN                           759
#define CWG1SHUTDOWN                  760
#define SHUTDOWN                      761
#define CWG1AS1                       762
#define AS0E                          763
#define AS1E                          764
#define AS2E                          765
#define AS3E                          766
#define CWG1STR                       767
#define CWG1STRA                      768
#define STRA                          769
#define STRB                          770
#define CWG1STRB                      771
#define CWG1STRC                      772
#define STRC                          773
#define CWG1STRD                      774
#define STRD                          775
#define OVRA                          776
#define CWG1OVRA                      777
#define CWG1OVRB                      778
#define OVRB                          779
#define OVRC                          780
#define CWG1OVRC                      781
#define OVRD                          782
#define CWG1OVRD                      783
#define NVMADR0                       784
#define NVMADRL                       785
#define NVMADR1                       786
#define NVMADR2                       787
#define NVMADR3                       788
#define NVMADR4                       789
#define NVMADR5                       790
#define NVMADR6                       791
#define NVMADR7                       792
#define NVMADR8                       793
#define NVMADRH                       794
#define NVMADR9                       795
#define NVMADR10                      796
#define NVMADR11                      797
#define NVMADR12                      798
#define NVMADR13                      799
#define NVMADR14                      800
#define NVMDAT0                       801
#define NVMDATL                       802
#define NVMDAT1                       803
#define NVMDAT2                       804
#define NVMDAT3                       805
#define NVMDAT4                       806
#define NVMDAT5                       807
#define NVMDAT6                       808
#define NVMDAT7                       809
#define NVMDAT8                       810
#define NVMDATH                       811
#define NVMDAT9                       812
#define NVMDAT10                      813
#define NVMDAT11                      814
#define NVMDAT12                      815
#define NVMDAT13                      816
#define NVMCON1                       817
#define RD                            818
#define WR                            819
#define WREN                          820
#define WRERR                         821
#define FREE                          822
#define LWLO                          823
#define NVMREGS                       824
#define NVMCON2                       825
#define NMVCON2                       826
#define PCON0                         827
#define nBOR                          828
#define nPOR                          829
#define nRI                           830
#define nRMCLR                        831
#define nRWDT                         832
#define STKUNF                        833
#define STKOVF                        834
#define PMD0                          835
#define IOCMD                         836
#define CLKRMD                        837
#define NVMMD                         838
#define FVRMD                         839
#define SYSCMD                        840
#define PMD1                          841
#define TMR0MD                        842
#define TMR1MD                        843
#define TMR2MD                        844
#define NCOMD                         845
#define PMD2                          846
#define CMP1MD                        847
#define CMP2MD                        848
#define ADCMD                         849
#define DACMD                         850
#define PMD3                          851
#define CCP1MD                        852
#define CCP2MD                        853
#define PWM5MD                        854
#define PWM6MD                        855
#define CWG1MD                        856
#define PMD4                          857
#define MSSP1MD                       858
#define UART1MD                       859
#define PMD5                          860
#define DSMMD                         861
#define CLC1MD                        862
#define CLC2MD                        863
#define CPUDOZE                       864
#define DOZE0                         865
#define DOZE                          866
#define DOZE1                         867
#define DOZE2                         868
#define DOE                           869
#define ROI                           870
#define DOZEN                         871
#define IDLEN                         872
#define OSCCON1                       873
#define NDIV0                         874
#define NDIV                          875
#define NDIV1                         876
#define NDIV2                         877
#define NDIV3                         878
#define NOSC0                         879
#define NOSC                          880
#define NOSC1                         881
#define NOSC2                         882
#define OSCCON2                       883
#define CDIV0                         884
#define CDIV                          885
#define CDIV1                         886
#define CDIV2                         887
#define CDIV3                         888
#define COSC                          889
#define COSC0                         890
#define COSC1                         891
#define COSC2                         892
#define OSCCON3                       893
#define NOSCR                         894
#define ORDY                          895
#define SOSCBE                        896
#define SOSCPWR                       897
#define CSWHOLD                       898
#define OSCSTAT1                      899
#define PLLR                          900
#define ADOR                          901
#define SOR                           902
#define LFOR                          903
#define HFOR                          904
#define EXTOR                         905
#define OSCEN                         906
#define ADOEN                         907
#define SOSCEN                        908
#define LFOEN                         909
#define HFOEN                         910
#define EXTOEN                        911
#define OSCTUNE                       912
#define HFTUN0                        913
#define HFTUN                         914
#define HFTUN1                        915
#define HFTUN2                        916
#define HFTUN3                        917
#define HFTUN4                        918
#define HFTUN5                        919
#define OSCFRQ                        920
#define HFFRQ                         921
#define HFFRQ0                        922
#define HFFRQ1                        923
#define HFFRQ2                        924
#define HFFRQ3                        925
#define PPSLOCK                       926
#define PPSLOCKED                     927
#define INTPPS0                       928
#define INTPPS                        929
#define INTPPS1                       930
#define INTPPS2                       931
#define INTPPS3                       932
#define INTPPS4                       933
#define T0CKIPPS0                     934
#define T0CKIPPS                      935
#define T0CKIPPS1                     936
#define T0CKIPPS2                     937
#define T0CKIPPS3                     938
#define T0CKIPPS4                     939
#define T1CKIPPS0                     940
#define T1CKIPPS                      941
#define T1CKIPPS1                     942
#define T1CKIPPS2                     943
#define T1CKIPPS3                     944
#define T1CKIPPS4                     945
#define T1GPPS0                       946
#define T1GPPS                        947
#define T1GPPS1                       948
#define T1GPPS2                       949
#define T1GPPS3                       950
#define T1GPPS4                       951
#define CCP1PPS0                      952
#define CCP1PPS                       953
#define CCP1PPS1                      954
#define CCP1PPS2                      955
#define CCP1PPS3                      956
#define CCP1PPS4                      957
#define CCP2PPS0                      958
#define CCP2PPS                       959
#define CCP2PPS1                      960
#define CCP2PPS2                      961
#define CCP2PPS3                      962
#define CCP2PPS4                      963
#define CWG1PPS0                      964
#define CWG1PPS                       965
#define CWG1PPS1                      966
#define CWG1PPS2                      967
#define CWG1PPS3                      968
#define CWG1PPS4                      969
#define MDCIN1PPS                     970
#define MDCIN1PPS0                    971
#define MDCIN1PPS1                    972
#define MDCIN1PPS2                    973
#define MDCIN1PPS3                    974
#define MDCIN1PPS4                    975
#define MDCIN2PPS0                    976
#define MDCIN2PPS                     977
#define MDCIN2PPS1                    978
#define MDCIN2PPS2                    979
#define MDCIN2PPS3                    980
#define MDCIN2PPS4                    981
#define MDMINPPS                      982
#define MDMINPPS0                     983
#define MDMINPPS1                     984
#define MDMINPPS2                     985
#define MDMINPPS3                     986
#define MDMINPPS4                     987
#define SSP1CLKPPS0                   988
#define SSP1CLKPPS                    989
#define SSP1CLKPPS1                   990
#define SSP1CLKPPS2                   991
#define SSP1CLKPPS3                   992
#define SSP1CLKPPS4                   993
#define SSP1DATPPS0                   994
#define SSP1DATPPS                    995
#define SSP1DATPPS1                   996
#define SSP1DATPPS2                   997
#define SSP1DATPPS3                   998
#define SSP1DATPPS4                   999
#define SSP1SSPPS                     1000
#define SSP1SSPPS0                    1001
#define SSP1SSPPS1                    1002
#define SSP1SSPPS2                    1003
#define SSP1SSPPS3                    1004
#define SSP1SSPPS4                    1005
#define RXPPS0                        1006
#define RXPPS                         1007
#define RXPPS1                        1008
#define RXPPS2                        1009
#define RXPPS3                        1010
#define RXPPS4                        1011
#define TXPPS0                        1012
#define TXPPS                         1013
#define TXPPS1                        1014
#define TXPPS2                        1015
#define TXPPS3                        1016
#define TXPPS4                        1017
#define CLCIN0PPS                     1018
#define CLCIN0PPS0                    1019
#define CLCIN0PPS1                    1020
#define CLCIN0PPS2                    1021
#define CLCIN0PPS3                    1022
#define CLCIN0PPS4                    1023
#define CLCIN1PPS0                    1024
#define CLCIN1PPS                     1025
#define CLCIN1PPS1                    1026
#define CLCIN1PPS2                    1027
#define CLCIN1PPS3                    1028
#define CLCIN1PPS4                    1029
#define CLCIN2PPS                     1030
#define CLCIN2PPS0                    1031
#define CLCIN2PPS1                    1032
#define CLCIN2PPS2                    1033
#define CLCIN2PPS3                    1034
#define CLCIN2PPS4                    1035
#define CLCIN3PPS                     1036
#define CLCIN3PPS0                    1037
#define CLCIN3PPS1                    1038
#define CLCIN3PPS2                    1039
#define CLCIN3PPS3                    1040
#define CLCIN3PPS4                    1041
#define RA0PPS                        1042
#define RA0PPS0                       1043
#define RA0PPS1                       1044
#define RA0PPS2                       1045
#define RA0PPS3                       1046
#define RA0PPS4                       1047
#define RA1PPS                        1048
#define RA1PPS0                       1049
#define RA1PPS1                       1050
#define RA1PPS2                       1051
#define RA1PPS3                       1052
#define RA1PPS4                       1053
#define RA2PPS0                       1054
#define RA2PPS                        1055
#define RA2PPS1                       1056
#define RA2PPS2                       1057
#define RA2PPS3                       1058
#define RA2PPS4                       1059
#define RA4PPS                        1060
#define RA4PPS0                       1061
#define RA4PPS1                       1062
#define RA4PPS2                       1063
#define RA4PPS3                       1064
#define RA4PPS4                       1065
#define RA5PPS                        1066
#define RA5PPS0                       1067
#define RA5PPS1                       1068
#define RA5PPS2                       1069
#define RA5PPS3                       1070
#define RA5PPS4                       1071
#define RC0PPS                        1072
#define RC0PPS0                       1073
#define RC0PPS1                       1074
#define RC0PPS2                       1075
#define RC0PPS3                       1076
#define RC0PPS4                       1077
#define RC1PPS0                       1078
#define RC1PPS                        1079
#define RC1PPS1                       1080
#define RC1PPS2                       1081
#define RC1PPS3                       1082
#define RC1PPS4                       1083
#define RC2PPS                        1084
#define RC2PPS0                       1085
#define RC2PPS1                       1086
#define RC2PPS2                       1087
#define RC2PPS3                       1088
#define RC2PPS4                       1089
#define RC3PPS                        1090
