tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18323_tdd.h
#define RC3PPS0                       1091
#define RC3PPS1                       1092
#define RC3PPS2                       1093
#define RC3PPS3                       1094
#define RC3PPS4                       1095
#define RC4PPS0                       1096
#define RC4PPS                        1097
#define RC4PPS1                       1098
#define RC4PPS2                       1099
#define RC4PPS3                       1100
#define RC4PPS4                       1101
#define RC5PPS0                       1102
#define RC5PPS                        1103
#define RC5PPS1                       1104
#define RC5PPS2                       1105
#define RC5PPS3                       1106
#define RC5PPS4                       1107
#define CLCDATA                       1108
#define MLC1OUT                       1109
#define MLC2OUT                       1110
#define CLC1CON                       1111
#define CLC1CON_MODE0                 1112
#define LC1MODE                       1113
#define CLC1CON_MODE                  1114
#define LC1MODE0                      1115
#define CLC1CON_MODE1                 1116
#define LC1MODE1                      1117
#define LC1MODE2                      1118
#define CLC1CON_MODE2                 1119
#define LC1INTN                       1120
#define CLC1CON_INTN                  1121
#define CLC1CON_INTP                  1122
#define LC1INTP                       1123
#define LC1OUT                        1124
#define CLC1CON_OUT                   1125
#define CLC1CON_EN                    1126
#define LC1EN                         1127
#define CLC1POL                       1128
#define LC1G1POL                      1129
#define CLC1POL_G1POL                 1130
#define CLC1POL_G2POL                 1131
#define LC1G2POL                      1132
#define LC1G3POL                      1133
#define CLC1POL_G3POL                 1134
#define LC1G4POL                      1135
#define CLC1POL_G4POL                 1136
#define CLC1POL_POL                   1137
#define LC1POL                        1138
#define CLC1SEL0                      1139
#define CLC1SEL0_D1S0                 1140
#define LC1D1S                        1141
#define LC1D1S0                       1142
#define CLC1SEL0_D1S                  1143
#define CLC1SEL0_D1S1                 1144
#define LC1D1S1                       1145
#define CLC1SEL0_D1S2                 1146
#define LC1D1S2                       1147
#define CLC1SEL0_D1S3                 1148
#define LC1D1S3                       1149
#define CLC1SEL0_D1S4                 1150
#define LC1D1S4                       1151
#define CLC1SEL1                      1152
#define CLC1SEL1_D2S0                 1153
#define CLC1SEL1_D2S                  1154
#define LC1D2S                        1155
#define LC1D2S0                       1156
#define CLC1SEL1_D2S1                 1157
#define LC1D2S1                       1158
#define LC1D2S2                       1159
#define CLC1SEL1_D2S2                 1160
#define LC1D2S3                       1161
#define CLC1SEL1_D2S3                 1162
#define LC1D2S4                       1163
#define CLC1SEL1_D2S4                 1164
#define CLC1SEL2                      1165
#define LC1D3S0                       1166
#define CLC1SEL2_D3S                  1167
#define LC1D3S                        1168
#define CLC1SEL2_D3S0                 1169
#define LC1D3S1                       1170
#define CLC1SEL2_D3S1                 1171
#define LC1D3S2                       1172
#define CLC1SEL2_D3S2                 1173
#define LC1D3S3                       1174
#define CLC1SEL2_D3S3                 1175
#define LC1D3S4                       1176
#define CLC1SEL2_D3S4                 1177
#define CLC1SEL3                      1178
#define CLC1SEL3_D4S                  1179
#define LC1D4S                        1180
#define LC1D4S0                       1181
#define CLC1SEL3_D4S0                 1182
#define CLC1SEL3_D4S1                 1183
#define LC1D4S1                       1184
#define LC1D4S2                       1185
#define CLC1SEL3_D4S2                 1186
#define LC1D4S3                       1187
#define CLC1SEL3_D4S3                 1188
#define LC1D4S4                       1189
#define CLC1SEL3_D4S4                 1190
#define CLC1GLS0                      1191
#define CLC1GLS0_D1N                  1192
#define LC1G1D1N                      1193
#define CLC1GLS0_D1T                  1194
#define LC1G1D1T                      1195
#define LC1G1D2N                      1196
#define CLC1GLS0_D2N                  1197
#define LC1G1D2T                      1198
#define CLC1GLS0_D2T                  1199
#define CLC1GLS0_D3N                  1200
#define LC1G1D3N                      1201
#define CLC1GLS0_D3T                  1202
#define LC1G1D3T                      1203
#define CLC1GLS0_D4N                  1204
#define LC1G1D4N                      1205
#define CLC1GLS0_D4T                  1206
#define LC1G1D4T                      1207
#define CLC1GLS1                      1208
#define CLC1GLS1_D1N                  1209
#define LC1G2D1N                      1210
#define LC1G2D1T                      1211
#define CLC1GLS1_D1T                  1212
#define CLC1GLS1_D2N                  1213
#define LC1G2D2N                      1214
#define LC1G2D2T                      1215
#define CLC1GLS1_D2T                  1216
#define CLC1GLS1_D3N                  1217
#define LC1G2D3N                      1218
#define LC1G2D3T                      1219
#define CLC1GLS1_D3T                  1220
#define CLC1GLS1_D4N                  1221
#define LC1G2D4N                      1222
#define LC1G2D4T                      1223
#define CLC1GLS1_D4T                  1224
#define CLC1GLS2                      1225
#define CLC1GLS2_D1N                  1226
#define LC1G3D1N                      1227
#define LC1G3D1T                      1228
#define CLC1GLS2_D1T                  1229
#define LC1G3D2N                      1230
#define CLC1GLS2_D2N                  1231
#define LC1G3D2T                      1232
#define CLC1GLS2_D2T                  1233
#define CLC1GLS2_D3N                  1234
#define LC1G3D3N                      1235
#define LC1G3D3T                      1236
#define CLC1GLS2_D3T                  1237
#define LC1G3D4N                      1238
#define CLC1GLS2_D4N                  1239
#define LC1G3D4T                      1240
#define CLC1GLS2_D4T                  1241
#define CLC1GLS3                      1242
#define LC1G4D1N                      1243
#define CLC1GLS3_G4D1N                1244
#define LC1G4D1T                      1245
#define CLC1GLS3_G4D1T                1246
#define CLC1GLS3_G4D2N                1247
#define LC1G4D2N                      1248
#define CLC1GLS3_G4D2T                1249
#define LC1G4D2T                      1250
#define LC1G4D3N                      1251
#define CLC1GLS3_G4D3N                1252
#define LC1G4D3T                      1253
#define CLC1GLS3_G4D3T                1254
#define CLC1GLS3_G4D4N                1255
#define LC1G4D4N                      1256
#define CLC1GLS3_G4D4T                1257
#define LC1G4D4T                      1258
#define CLC2CON                       1259
#define LC2MODE0                      1260
#define CLC2CON_MODE                  1261
#define LC2MODE                       1262
#define CLC2CON_MODE0                 1263
#define LC2MODE1                      1264
#define CLC2CON_MODE1                 1265
#define LC2MODE2                      1266
#define CLC2CON_MODE2                 1267
#define LC2INTN                       1268
#define CLC2CON_INTN                  1269
#define LC2INTP                       1270
#define CLC2CON_INTP                  1271
#define CLC2CON_OUT                   1272
#define LC2OUT                        1273
#define CLC2CON_EN                    1274
#define LC2EN                         1275
#define CLC2POL                       1276
#define LC2G1POL                      1277
#define CLC2POL_G1POL                 1278
#define LC2G2POL                      1279
#define CLC2POL_G2POL                 1280
#define LC2G3POL                      1281
#define CLC2POL_G3POL                 1282
#define LC2G4POL                      1283
#define CLC2POL_G4POL                 1284
#define CLC2POL_POL                   1285
#define LC2POL                        1286
#define CLC2SEL0                      1287
#define CLC2SEL0_D1S                  1288
#define LC2D1S0                       1289
#define CLC2SEL0_D1S0                 1290
#define LC2D1S                        1291
#define LC2D1S1                       1292
#define CLC2SEL0_D1S1                 1293
#define LC2D1S2                       1294
#define CLC2SEL0_D1S2                 1295
#define CLC2SEL0_D1S3                 1296
#define LC2D1S3                       1297
#define LC2D1S4                       1298
#define CLC2SEL0_D1S4                 1299
#define CLC2SEL1                      1300
#define LC2D2S0                       1301
#define CLC2SEL1_D2S0                 1302
#define LC2D2S                        1303
#define CLC2SEL1_D2S                  1304
#define LC2D2S1                       1305
#define CLC2SEL1_D2S1                 1306
#define LC2D2S2                       1307
#define CLC2SEL1_D2S2                 1308
#define LC2D2S3                       1309
#define CLC2SEL1_D2S3                 1310
#define LC2D2S4                       1311
#define CLC2SEL1_D2S4                 1312
#define CLC2SEL2                      1313
#define CLC2SEL2_D3S                  1314
#define LC2D3S0                       1315
#define CLC2SEL2_D3S0                 1316
#define LC2D3S                        1317
#define CLC2SEL2_D3S1                 1318
#define LC2D3S1                       1319
#define LC2D3S2                       1320
#define CLC2SEL2_D3S2                 1321
#define LC2D3S3                       1322
#define CLC2SEL2_D3S3                 1323
#define LC2D3S4                       1324
#define CLC2SEL2_D3S4                 1325
#define CLC2SEL3                      1326
#define LC2D4S                        1327
#define LC2D4S0                       1328
#define CLC2SEL3_D4S                  1329
#define CLC2SEL3_D4S0                 1330
#define LC2D4S1                       1331
#define CLC2SEL3_D4S1                 1332
#define LC2D4S2                       1333
#define CLC2SEL3_D4S2                 1334
#define CLC2SEL3_D4S3                 1335
#define LC2D4S3                       1336
#define LC2D4S4                       1337
#define CLC2SEL3_D4S4                 1338
#define CLC2GLS0                      1339
#define LC2G1D1N                      1340
#define CLC2GLS0_D1N                  1341
#define CLC2GLS0_D1T                  1342
#define LC2G1D1T                      1343
#define LC2G1D2N                      1344
#define CLC2GLS0_D2N                  1345
#define CLC2GLS0_D2T                  1346
#define LC2G1D2T                      1347
#define LC2G1D3N                      1348
#define CLC2GLS0_D3N                  1349
#define CLC2GLS0_D3T                  1350
#define LC2G1D3T                      1351
#define LC2G1D4N                      1352
#define CLC2GLS0_D4N                  1353
#define CLC2GLS0_D4T                  1354
#define LC2G1D4T                      1355
#define CLC2GLS1                      1356
#define CLC2GLS1_D1N                  1357
#define LC2G2D1N                      1358
#define CLC2GLS1_D1T                  1359
#define LC2G2D1T                      1360
#define CLC2GLS1_D2N                  1361
#define LC2G2D2N                      1362
#define CLC2GLS1_D2T                  1363
#define LC2G2D2T                      1364
#define LC2G2D3N                      1365
#define CLC2GLS1_D3N                  1366
#define LC2G2D3T                      1367
#define CLC2GLS1_D3T                  1368
#define LC2G2D4N                      1369
#define CLC2GLS1_D4N                  1370
#define LC2G2D4T                      1371
#define CLC2GLS1_D4T                  1372
#define CLC2GLS2                      1373
#define LC2G3D1N                      1374
#define CLC2GLS2_D1N                  1375
#define CLC2GLS2_D1T                  1376
#define LC2G3D1T                      1377
#define CLC2GLS2_D2N                  1378
#define LC2G3D2N                      1379
#define LC2G3D2T                      1380
#define CLC2GLS2_D2T                  1381
#define CLC2GLS2_D3N                  1382
#define LC2G3D3N                      1383
#define CLC2GLS2_D3T                  1384
#define LC2G3D3T                      1385
#define CLC2GLS2_D4N                  1386
#define LC2G3D4N                      1387
#define LC2G3D4T                      1388
#define CLC2GLS2_D4T                  1389
#define CLC2GLS3                      1390
#define LC2G4D1N                      1391
#define CLC2GLS3_G4D1N                1392
#define CLC2GLS3_G4D1T                1393
#define LC2G4D1T                      1394
#define CLC2GLS3_G4D2N                1395
#define LC2G4D2N                      1396
#define LC2G4D2T                      1397
#define CLC2GLS3_G4D2T                1398
#define CLC2GLS3_G4D3N                1399
#define LC2G4D3N                      1400
#define CLC2GLS3_G4D3T                1401
#define LC2G4D3T                      1402
#define LC2G4D4N                      1403
#define CLC2GLS3_G4D4N                1404
#define CLC2GLS3_G4D4T                1405
#define LC2G4D4T                      1406
#define STATUS_SHAD                   1407
#define C_SHAD                        1408
#define DC_SHAD                       1409
#define Z_SHAD                        1410
#define WREG_SHAD                     1411
#define BSR_SHAD                      1412
#define PCLATH_SHAD                   1413
#define FSR0L_SHAD                    1414
#define FSR0H_SHAD                    1415
#define FSR1L_SHAD                    1416
#define FSR1H_SHAD                    1417
#define STKPTR                        1418
#define TOSL                          1419
#define TOSH                          1420

#endif // _PIC16F18323_H_
